OpenFOAM-v1812/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeater/constant/leftSolid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2212                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/leftSolid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
    minX
    {
        type            patch;
        nFaces          10;
        startFace       237;
    }

    minZ
    {
        type            patch;
        inGroups        1 ( wall );
        nFaces          13;
        startFace       247;
    }

    maxZ
    {
        type            patch;
        inGroups        1 ( wall );
        nFaces          13;
        startFace       260;
    }

    leftSolid_to_bottomWater
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          130;
        startFace       273;
        sampleMode      nearestPatchFace;
        sampleRegion    bottomWater;
        samplePatch     bottomWater_to_leftSolid;
    }

    leftSolid_to_heater
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          10;
        startFace       403;
        sampleMode      nearestPatchFace;
        sampleRegion    heater;
        samplePatch     heater_to_leftSolid;
    }

    leftSolid_to_topAir
    {
        type            mappedWall;
        inGroups        1 ( wall );
        nFaces          130;
        startFace       413;
        sampleMode      nearestPatchFace;
        sampleRegion    topAir;
        samplePatch     topAir_to_leftSolid;
    }

)


// ************************************************************************* //
